# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs


# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # 支持：mobilenetv4_small, mobilenetv4_medium, mobilenetv4_large, mobilenetv4_hybrid_medium, mobilenetv4_hybrid_large
  - [-1, 1, mobilenetv4_small, []]  # 4
  - [-1, 1, SPPF, [128, 5]]  # 5

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 6: 128
  - [[-1, 3], 1, Concat, [1]]                   # 7: 128+96=224
  - [-1, 3, C2f_SHViTBlock, [128]]                        # 8: 224→128

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 9: 128
  - [[-1, 2], 1, Concat, [1]]                   # 10: 128+64=192
  - [-1, 3, C2f_SHViTBlock, [128]]                        # 11: 192→128 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]                 # 12: 128→128
  - [[-1, 8], 1, Concat, [1]]                   # 13: 128+128=256
  - [-1, 3, C2f_SHViTBlock, [256]]                        # 14: 256→256 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]                 # 15: 256→256
  - [[-1, 5], 1, Concat, [1]]                   # 16: 256+128=384
  - [-1, 3, C2f_SHViTBlock, [384]]                        # 17: 384→384 (P5/32-large)

  - [[11, 14, 17], 1, Segment, [nc, 32, 256]]  # 输入: [128, 256, 384]